The folder location for .addin files for all users.
  Namespace:   Autodesk.Revit.ApplicationServices
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public string AllUsersAddinsLocation { get; }
  Visual Basic
Public ReadOnly Property AllUsersAddinsLocation As String
	Get
  Visual C++
public:
property String^ AllUsersAddinsLocation {
	String^ get ();
}
 See Also
  ControlledApplication Class
  Autodesk.Revit.ApplicationServices Namespace